<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8e798dd1bc7c600c5d81a2438c448fbe8241df79f302b63f4ec404faec5eba9f","plan_job_ref":"Job Terraform Plan #94 at https://github.com/cal-itp/data-infra/actions/runs/14475122402","plan_out_hash":"9c9d492be9d636ae0c9e56bd4fff24f64f520577f1da27e33fd07f7fa4308624","plan_hash":"686b7693c31a901e89320d97cfa018782d53ff882172e8a202bcdb4c3d046e9f","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.github_publish_website_action_role will be created
+   resource "google_project_iam_custom_role" "github_publish_website_action_role" {
+       deleted     = (known after apply)
+       description = "Role for GitHub Actions to deploy to GCS"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "storage.buckets.get",
+           "storage.objects.create",
+           "storage.objects.delete",
+           "storage.objects.get",
+           "storage.objects.list",
        ]
+       project     = "cal-itp-data-infra"
+       role_id     = "******************"
+       stage       = "GA"
+       title       = "GitHub Publish Website to GCS Bucket Action Role"
    }

  # google_project_iam_member.github_action_sa_binding will be created
+   resource "google_project_iam_member" "github_action_sa_binding" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/google_project_iam_custom_role.github_action_role.name"
    }

  # google_service_account.github_action_sa will be created
+   resource "google_service_account" "github_action_sa" {
+       account_id   = "****************"
+       disabled     = false
+       display_name = "GitHub Action Service Account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = (known after apply)
+       unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   service_account_email                                                                                                                                                                                                         = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #94](https://github.com/cal-itp/data-infra/actions/runs/14475122402)